Revit 2027 API
BuiltInFailures.CutFailures.CannotCutJoinedElement Property
 Can't cut joined element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutJoinedElement { get; }
Public Shared ReadOnly Property CannotCutJoinedElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutJoinedElement {
	FailureDefinitionId^ get ();
}
static member CannotCutJoinedElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace